
# üß© Titanic Dataset Exploration with pandas

üéØ **Goal:**  
In this notebook, you'll explore the Titanic dataset using **pandas**.  
You'll practice the most common pandas functions for data inspection, selection, filtering, cleaning, and analysis.

For each function in the list below:
1. Explain what it does (in your own words, in a Markdown cell).
2. Give at least **two examples** using the Titanic dataset.
3. Add a short comment about the output or why it‚Äôs useful.

In [1]:

import pandas as pd

# Load Titanic dataset
# (Make sure titanic.csv is in the same folder as this notebook)
df = pd.read_csv("titanic_dataset.csv")


## üß† Step 1: Inspecting the Data

Functions to explore:
- df.head()
- df.tail()
- df.info()
- df.describe()
- df.shape
- df.columns

### df.head()

 muestras las primer filas del dataframe tomando por defecto 5

In [2]:

# Ejemplo: df.head()
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
# Ejemplo 2
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

### df.tail()

Muestra las √∫ltimas filas del dataframe tomando por defecto 5

In [4]:
#Ejemplo: df.tail()
df.tail() #√öltimas 5 filas

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [5]:
#Ejemplo 2
df.tail(2)  #√öltimas 2 filas

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

### df.info()

Muestra un resumen de datos del DataFrame estos son:


Cantidad de filas y columnas,
Nombres de las columnas,
Tipos de datos y
Valores nulos

In [6]:
#Ejemplo: df.info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
#Ejemplo 2 
df2 = pd.DataFrame({
    "Nombre": ["Ana", "Luis", "Mar√≠a"],
    "Edad": [23, None, 19],
    "Ciudad": ["Madrid", "Sevilla", "Barcelona"]
})
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Nombre  3 non-null      object
 1   Edad    2 non-null      float64
 2   Ciudad  3 non-null      object
dtypes: float64(1), object(2)
memory usage: 204.0+ bytes

### df.describe()

 Muestra datos estad√≠sticos de las columnas con valores num√©ricos, algunos de estos datos estos son:
Media,
Desviaci√≥n,
M√≠nimo,
M√°ximo y
Porcentajes

In [8]:
#Ejemplo: df.describe()
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [9]:
#Ejemplo 2
df2 = pd.DataFrame({
    "Altura": [1.75, 1.60, 1.82, 1.90],
    "Peso": [70, 55, 80, 90]
})
df2.describe()

         Altura       Peso
count  4.000000   4.000000
mean   1.767500  73.750000
std    0.127377  14.930394
min    1.600000  55.000000
25%    1.712500  66.250000
50%    1.785000  75.000000
75%    1.840000  82.500000
max    1.900000  90.000000

### df.shape()

Devuelve una tupla con las dimensiones del dataframe

In [10]:
#Ejemplo: df.shape()
df.shape

(891, 12)

In [11]:
#Ejemplo 2
filas, columnas = df.shape
print(f"El titanic_dataset tiene {filas} filas y {columnas} columnas")

El titanic_dataset tiene 891 filas y 12 columnas

### df.columns()

Devuelve una lista con los nombres de las columnas

In [12]:
#Ejemplo: df.columns
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [13]:
#Ejemplo 2
for columna in df.columns:
    print("Columna:", columna)

Columna: PassengerId
Columna: Survived
Columna: Pclass
Columna: Name
Columna: Sex
Columna: Age
Columna: SibSp
Columna: Parch
Columna: Ticket
Columna: Fare
Columna: Cabin
Columna: Embarked


## üîç Step 2: Selecting Data
Functions to explore:
- df["column"]
- df[["col1", "col2"]]
- df.loc[]
- df.iloc[]

### df["column"]

Devuelve una lista con los nombres de las columnas

In [14]:
# Ejemplo: df["column"]
df["Age"].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [15]:
#Ejemplo 2
df["Sex"].head()

0      male
1    female
2    female
3    female
4      male
Name: Sex, dtype: object

### df[["col1","col2"]]

Selecciona varias columnas a la vez y devuelve un Dataframe con sus valores

In [16]:
# Ejemplo: df[["col","col2"]] 
df[["Sex", "Age", "Survived"]].head()

      Sex   Age  Survived
0    male  22.0         0
1  female  38.0         1
2  female  26.0         1
3  female  35.0         1
4    male  35.0         0

In [17]:
# Ejemplo 2
df[["Pclass", "Survived"]].head()

   Pclass  Survived
0       3         0
1       1         1
2       3         1
3       1         1
4       3         0

### df.loc[]

Selecciona filas y columnas por etiquetas

In [18]:
#Ejemplo: df.loc[]
df.loc[0, "Name"]

'Braund, Mr. Owen Harris'

In [19]:
#Ejemplo 2
df.loc[0:4, ["Name", "Age", "Sex"]]

                                                Name   Age     Sex
0                            Braund, Mr. Owen Harris  22.0    male
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0  female
2                             Heikkinen, Miss. Laina  26.0  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0  female
4                           Allen, Mr. William Henry  35.0    male

### df.iloc[]

Selecciona filas y columnas por su posici√≥n num√©rica

In [20]:
#Ejemplo: df.iloc[]
df.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [21]:
#Ejemplo 2
df.iloc[0:3, 1:4]

   Survived  Pclass                                               Name
0         0       3                            Braund, Mr. Owen Harris
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1       3                             Heikkinen, Miss. Laina


## üîé Step 3: Filtering Rows

Functions to explore:
- df[df["Age"] > 30]
- df.query("Sex == 'female' and Survived == 1")

### df[df["column"] > 30]

Filtra y devuelve las filas donde la columna cumple con las condiciones asignadas

In [22]:

#Ejemplo : df[df["column"]]
df[df["Age"] > 50].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C

In [23]:
#Ejemplo 2
df[(df["Age"] > 30) & (df["Sex"] == "male")]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
...,...,...,...,...,...,...,...,...,...,...,...,...
867,868,0,1,"Roebling, Mr. Washington Augustus II",male,31.0,0,0,PC 17590,50.4958,A24,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
873,874,0,3,"Vander Cruyssen, Mr. Victor",male,47.0,0,0,345765,9.0000,NaN,S
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### df.query()

Usa la sintaxis de consulta tipo SQL para filtrar filas don se cumplan condiciones expresadas

In [24]:
#Ejemplo df.query()
df.query("Sex == 'female' and Survived == 1").head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [25]:
#Ejemplo 2
df.query("Sex == 'male' and Survived == 0 and Age < 20").head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
50,51,0,3,"Panula, Master. Juha Niilo",male,7.0,4,1,3101295,39.6875,NaN,S
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9000,NaN,S


## üßπ Step 4: Handling Missing Data

Functions to explore:
- df.isna()
- df.isna().sum()
- df.dropna()
- df.fillna()

### df.isna()

Devuelve un DataFrame de valores boolean indicando si las cada celda tiene valor NaN o None(True si falta el dato)

In [26]:
#Ejemplo df.isna()
df.isna()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False
887,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False
889,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False

In [27]:
#Ejemplo 2
df[df.isna().any(axis=1)].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S

### df.isna().sum()

Cuenta cuantos valores NaN hay en cada columna

In [28]:
# Ejemplo df.isna.sum()
df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [29]:
# Ejemplo 2
df.isna().sum().sum()

np.int64(866)

### df.dropna()

Elimina filas o columnas con valores nulos

In [30]:
# Ejemplo df.dropna()
df_sin_nulos = df.dropna()
df_sin_nulos

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [31]:
#Ejemplo 2
df_col = df.dropna(axis=1)
df_col

,PassengerId,Survived,Pclass,Name,Sex,SibSp,Parch,Ticket,Fare
0,1,0,3,"Braund, Mr. Owen Harris",male,1,0,A/5 21171,7.2500
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,0,PC 17599,71.2833
2,3,1,3,"Heikkinen, Miss. Laina",female,0,0,STON/O2. 3101282,7.9250
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,0,113803,53.1000
4,5,0,3,"Allen, Mr. William Henry",male,0,0,373450,8.0500
...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,0,0,211536,13.0000
887,888,1,1,"Graham, Miss. Margaret Edith",female,0,0,112053,30.0000
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,1,2,W./C. 6607,23.4500
889,890,1,1,"Behr, Mr. Karl Howell",male,0,0,111369,30.0000
890,891,0,3,"Dooley, Mr. Patrick",male,0,0,370376,7.7500

### df.fillna()

Rellena los valores nulos con un valor

In [32]:
# Ejemplo df.fillna()
df_text = df.fillna("Desconocido")
df_text.head

<bound method NDFrame.head of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex          Age  \
0                              Braund, Mr. Owen Harris    male         22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female         38.0
2                               Heikkinen, Miss. Laina  female         26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female         35.0
4                             Allen, Mr. William Henry    male         35.0
..                                                 ...     ...          ...
886                              Montvila, Rev. Juozas    male         27.0
887                       Graham, Miss. Margaret Edith  female         19.0
888           Johnston, Miss. Catherine Helen "Carrie"  female  Desconocido
889                              Behr, Mr. Karl Howell    male         26.0
890                                Dooley, Mr. Patrick    male         32.0

     SibSp  Parch            Ticket     Fare        Cabin Embarked
0        1      0         A/5 21171   7.2500  Desconocido        S
1        1      0          PC 17599  71.2833          C85        C
2        0      0  STON/O2. 3101282   7.9250  Desconocido        S
3        1      0            113803  53.1000         C123        S
4        0      0            373450   8.0500  Desconocido        S
..     ...    ...               ...      ...          ...      ...
886      0      0            211536  13.0000  Desconocido        S
887      0      0            112053  30.0000          B42        S
888      1      2        W./C. 6607  23.4500  Desconocido        S
889      0      0            111369  30.0000         C148        C
890      0      0            370376   7.7500  Desconocido        Q

[891 rows x 12 columns]>

In [33]:

# Ejemplo 2
df["Age"] = df["Age"].fillna(df["Age"].median())
df["Age"].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64


## üìä Step 5: Grouping and Aggregating

Functions to explore:
- df.groupby("Sex")["Survived"].mean()
- df["Fare"].mean()
- df["Age"].median()

### df.groupby("column1")["column2"]

Agrupa los datos por la columna1 y calcula el promedio de la segunda columna para cada grupo

In [34]:

# Ejemplo groupby()
df.groupby("Sex")["Survived"].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [35]:
# Ejemplo 2
df.groupby("Pclass")["Fare"].mean()

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

### df["colum1"].mean()

Calcula la media de la columna

In [36]:
#Ejemplo .mean()
df["Fare"].mean()

np.float64(32.204207968574636)

In [37]:
# Ejemplo 2
df["Age"].mean()

np.float64(29.36158249158249)

### df.["columna"].median()

Calcula la mediana de la columna

In [38]:
# Ejemplo .median()
df["Age"].median()

np.float64(28.0)

In [39]:
# Ejemplo 2
df["Fare"].median()

np.float64(14.4542)


## üìà Step 6: Sorting and Counting

Functions to explore:
- df.sort_values("Age")
- df["Sex"].unique()
- df["Pclass"].value_counts()

### df.sort_values("column")

Ordena los valores de la columna de menos a mayor

In [40]:

# Ejemplo df.sort.values()
df.sort_values("Age").head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S

In [41]:
# Ejemplo 2 (descendente)
df.sort_values("Age", ascending=False).head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q

### df.["column"].unique()

Devuelve un array con los valores unicos de las columnas

In [42]:
# Ejemplo df[""].unique()
df["Sex"].unique()

array(['male', 'female'], dtype=object)

In [43]:
# Ejemplo 2
df["Age"].unique()

array([22.  , 38.  , 26.  , 35.  , 28.  , 54.  ,  2.  , 27.  , 14.  ,
        4.  , 58.  , 20.  , 39.  , 55.  , 31.  , 34.  , 15.  ,  8.  ,
       19.  , 40.  , 66.  , 42.  , 21.  , 18.  ,  3.  ,  7.  , 49.  ,
       29.  , 65.  , 28.5 ,  5.  , 11.  , 45.  , 17.  , 32.  , 16.  ,
       25.  ,  0.83, 30.  , 33.  , 23.  , 24.  , 46.  , 59.  , 71.  ,
       37.  , 47.  , 14.5 , 70.5 , 32.5 , 12.  ,  9.  , 36.5 , 51.  ,
       55.5 , 40.5 , 44.  ,  1.  , 61.  , 56.  , 50.  , 36.  , 45.5 ,
       20.5 , 62.  , 41.  , 52.  , 63.  , 23.5 ,  0.92, 43.  , 60.  ,
       10.  , 64.  , 13.  , 48.  ,  0.75, 53.  , 57.  , 80.  , 70.  ,
       24.5 ,  6.  ,  0.67, 30.5 ,  0.42, 34.5 , 74.  ])

### df["column"].value_counts()

Cuenta cuantas veces aparece cada valor en la columna

In [44]:
# Ejemplo df[""].value_counts()
df["Pclass"].value_counts()

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [45]:
# Ejemplo 2
df["Sex"].value_counts()

Sex
male      577
female    314
Name: count, dtype: int64


## ‚öôÔ∏è Step 7: Creating or Modifying Columns

Functions to explore:
- df.assign()
- df.apply()
- df["new_col"] = ...
- pd.concat()
- pd.merge()

### df.assign()

Crea columnas en el DataFrame sin modificar el original delvolviendo una copia del mismo

In [46]:
# Ejemplo df.assign()
df2 = df.assign(Age_2 = df["Age"] * 2)
df2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_2
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,44.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,76.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,52.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,70.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,70.0

In [47]:
# Ejemplo 2
df2 = df.assign(Fare_per_Age = df["Fare"] / df["Age"])
df2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Fare_per_Age
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0.329545
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1.875876
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0.304808
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1.517143
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0.230000

### df.apply()

Aplica funciones a cada elemento, columna o fila del DataFrame

In [48]:
# Ejemplo df.apply()
df["Age_group"] = df["Age"].apply(lambda x: "Young" if x < 18 else "Adult")
df["Age_group"]

0      Adult
1      Adult
2      Adult
3      Adult
4      Adult
       ...
886    Adult
887    Adult
888    Adult
889    Adult
890    Adult
Name: Age_group, Length: 891, dtype: object

In [49]:
# Ejemplo 2
df["Total_Family"] = df.apply(lambda row: row["SibSp"] + row["Parch"], axis=1)
df["Total_Family"]

0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    3
889    0
890    0
Name: Total_Family, Length: 891, dtype: int64

### df["new_col"]

Crea o modifica una columna del DataFrame original

In [50]:
# Ejemplo df["new_col"]
df["Fare_per_Age"] = df["Fare"] / df["Age"]
df[["Age", "Fare", "Fare_per_Age"]].head()

    Age     Fare  Fare_per_Age
0  22.0   7.2500      0.329545
1  38.0  71.2833      1.875876
2  26.0   7.9250      0.304808
3  35.0  53.1000      1.517143
4  35.0   8.0500      0.230000

In [51]:
# Ejemplo 2
df["Ship"] = "Titanic"
df["Ship"]

0      Titanic
1      Titanic
2      Titanic
3      Titanic
4      Titanic
        ...
886    Titanic
887    Titanic
888    Titanic
889    Titanic
890    Titanic
Name: Ship, Length: 891, dtype: object

### pd.concat()

Une DataFrames por filas o columnas

In [52]:
# Ejemplo pd.concat()
df_combined = pd.concat([df[["Name"]], df[["Age"]]], axis=1)
df_combined

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"  28.0
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

In [53]:
# Ejemplo 2
df_test = pd.DataFrame({
    "PassengerId": [4, 5],
    "Survived": [1, 0],
    "Pclass": [1, 3],
    "Name": ["Futrelle, Mrs. Jacques", "Allen, Mr. William"],
    "Sex": ["female", "male"],
    "Age": [35, 35],
    "Fare": [53.1, 8.05]
})
df_train = pd.DataFrame({
    "PassengerId": [1, 2, 3],
    "Survived": [0, 1, 1],
    "Pclass": [3, 1, 3],
    "Name": ["Braund, Mr. Owen", "Cumings, Mrs. John", "Heikkinen, Miss. Laina"],
    "Sex": ["male", "female", "female"],
    "Age": [22, 38, 26],
    "Fare": [7.25, 71.2833, 7.925]
})
df_total = pd.concat([df_train, df_test])
df_total.head()

   PassengerId  Survived  Pclass                    Name     Sex  Age     Fare
0            1         0       3        Braund, Mr. Owen    male   22   7.2500
1            2         1       1      Cumings, Mrs. John  female   38  71.2833
2            3         1       3  Heikkinen, Miss. Laina  female   26   7.9250
0            4         1       1  Futrelle, Mrs. Jacques  female   35  53.1000
1            5         0       3      Allen, Mr. William    male   35   8.0500

### pd.merge()

Combina dos DataFrames  por una columna comun (Join en SQL)

In [54]:
#Ejemplo pd.merge
df_personal = df[["PassengerId", "Name", "Sex", "Age", "Pclass"]]
df_supervivencia = df[["PassengerId", "Survived"]]

df_final = pd.merge(df_personal, df_supervivencia, on="PassengerId", how="inner")
df_final.head()

,PassengerId,Name,Sex,Age,Pclass,Survived
0,1,"Braund, Mr. Owen Harris",male,22.0,3,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1
2,3,"Heikkinen, Miss. Laina",female,26.0,3,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1
4,5,"Allen, Mr. William Henry",male,35.0,3,0

In [55]:
# Ejemplo 2
df_economico = df[["PassengerId", "Ticket", "Fare", "Cabin", "Embarked"]]
df_final = pd.merge(df_personal, df_economico, on="PassengerId", how="inner")
df_final.head()

,PassengerId,Name,Sex,Age,Pclass,Ticket,Fare,Cabin,Embarked
0,1,"Braund, Mr. Owen Harris",male,22.0,3,A/5 21171,7.2500,NaN,S
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,3,STON/O2. 3101282,7.9250,NaN,S
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,S
4,5,"Allen, Mr. William Henry",male,35.0,3,373450,8.0500,NaN,S


## üíæ Step 8: Exporting Data

Function to explore:
- df.to_csv("output.csv", index=False)

### df.to_csv()

Guarda el contenido de un DataFrame en un arhcivo CSV

In [56]:
# Ejemplo df.to_csv()
##df.to_csv("titanic_cleaned.csv", index=False)

In [57]:
# Ejemplo 2
##df_total[["Name", "Sex", "Age"]].to_csv("pasajeros.csv", index=False)


## üß© Step 9: Summary

Reflect on what you learned:
- Which functions were most useful?
- What insights did you gain from the Titanic dataset?

### ¬øQu√© funciones fueron m√°s √∫tiles?

Las funciones m√°s √∫tiles fueron df.info() y df.value_counts(), ya que la primera es la esencial para obtener una vision generalizada de los distintos DataFrame y despu√©s 
df.value_counts() para analizar las distintas tasas de interes como las tasas de supervivencia por g√©nero o clase.

### ¬øQu√© informaci√≥n obtuviste del dataset del Titanic?

La informaci√≥n m√°s intesante que descubr√≠ es que las tasas de supervivencia reflejan claramente los patrones sociales de la √©poca, los cuales,lamentablemente, no distan mucho de los actuales.

La edad y la clase del billete influyeron significatimante al resultado demostrando que los pasajeros de primera clase tuvieron un porcentaje m√°s elevado que los de tercera, y lo mismo con los menores de edad que tienen una tasa mucho m√°s elevada que el resto.

El g√©nero tambi√©n tiene gran influencia en las posibilidades pero esa informaci√≥n es conocida por la famosa pel√≠cula m√°s que por este dataset.